Tekla.Structures.Analysis.AnalysisModelGeneralProperties.MemberAxisLocationEnum
Defines the member axis location.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.MemberAxisLocationEnum.MODEL_DEFAULT
The member axis is defined individually based on each part's properties.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.MemberAxisLocationEnum.REFERENCE_AXIS_ECCENTRICITY_BY_NEUTRAL_AXIS
The reference axis is the member axis. The location of
the neutral axis defines the axis eccentricity.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.MemberAxisLocationEnum.REFERENCE_AXIS
The reference axis is the member axis.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.MemberAxisLocationEnum.NEUTRAL_AXIS
The neutral axis is the member axis.